Revit 2027 API
FaceEdgeNode.GetFaceEdge Method
 Returns the Face edge object corresponding to the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Edge GetFaceEdge()
Public Function GetFaceEdge As Edge
public:
Edge^ GetFaceEdge()
member GetFaceEdge : unit -> Edge
Return Value
Edge
 The face edge.
See Also
Reference
FaceEdgeNode Class
Autodesk.Revit.DB Namespace